
## Plan Result (prod_dns)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_dns_record.main_records[&#34;home&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.main_records["home"] will be updated in-place
  ~ resource "cloudflare_dns_record" "main_records" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-02-23T20:17:22Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "622ecaccde0ac598edc65c028e7e13fc"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-02-23T20:17:22Z" -> (known after apply)
      ~ name                = "home.bancey.xyz" -> "home"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":527,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->